# **Selecting Columns**

In [49]:
import pandas as pd
import numpy as np

In [50]:
df_csv = pd.read_csv("StudentsPerformance.csv")

In [51]:
df_csv.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [52]:
# select a column with [] (preferred way to select a column)
df_csv['math score']

0      72
1      69
2      90
3      47
4      76
       ..
995    88
996    62
997    59
998    68
999    77
Name: math score, Length: 1000, dtype: int64

In [53]:
df_csv['gender']

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [54]:
type(df_csv["gender"])

pandas.core.series.Series

In [55]:
# Series: attributes and methods
df_csv['math score'].dtype

dtype('int64')

In [56]:
df_csv["math score"].head()

0    72
1    69
2    90
3    47
4    76
Name: math score, dtype: int64

In [57]:
df_csv["math score"].mean()

np.float64(66.089)

In [58]:
df_csv["math score"].shape

(1000,)

In [59]:
df_csv["math score"].head()
df_csv["math score"].mean()
df_csv["math score"].std()
df_csv["math score"].max()
df_csv["math score"].min()
df_csv["math score"].describe()

count    1000.00000
mean       66.08900
std        15.16308
min         0.00000
25%        57.00000
50%        66.00000
75%        77.00000
max       100.00000
Name: math score, dtype: float64

In [60]:
# select a column with dot notation
df_csv.gender

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [61]:
# select a column with dot notation (pitfalls)
# df_csv.math score
# SyntaxError: invalid syntax
# This happens because of the space in the column name
# To avoid this, we should use the [] notation
# df_csv.math_score  # This will work if the column name has no spaces

# Selecting Two or More Columns from a DataFrame

In [62]:
# selecting 2 columns using [[]]
df_csv[["gender", "math score"]]

     gender  math score
0    female          72
1    female          69
2    female          90
3      male          47
4      male          76
..      ...         ...
995  female          88
996    male          62
997  female          59
998  female          68
999  female          77

[1000 rows x 2 columns]

In [63]:
type(df_csv[["gender", "math score"]])

pandas.core.frame.DataFrame

In [64]:
df_csv[["math score", "reading score", "writing score", "gender"]]

     math score  reading score  writing score  gender
0            72             72             74  female
1            69             90             88  female
2            90             95             93  female
3            47             57             44    male
4            76             78             75    male
..          ...            ...            ...     ...
995          88             99             95  female
996          62             55             55    male
997          59             71             65  female
998          68             78             77  female
999          77             86             86  female

[1000 rows x 4 columns]

In [65]:
# Adding New Column to DataFrame

# adding a new column with a scalar value

df_csv["New Column"] = 100
df_csv.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,New Column
0,female,group B,bachelor's degree,standard,none,72,72,74,100
1,female,group C,some college,standard,completed,69,90,88,100
2,female,group B,master's degree,standard,none,90,95,93,100
3,male,group A,associate's degree,free/reduced,none,47,57,44,100
4,male,group C,some college,standard,none,76,78,75,100

In [66]:
# Adding a new column with  an array
language_score = np.arange(0,1000)
# len(np.arange(0,1000))

In [67]:
df_csv["language score"] = language_score
df_csv

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,New Column,language score
0,female,group B,bachelor's degree,standard,none,72,72,74,100,0
1,female,group C,some college,standard,completed,69,90,88,100,1
2,female,group B,master's degree,standard,none,90,95,93,100,2
3,male,group A,associate's degree,free/reduced,none,47,57,44,100,3
4,male,group C,some college,standard,none,76,78,75,100,4
...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,100,995
996,male,group C,high school,free/reduced,none,62,55,55,100,996
997,female,group C,high school,free/reduced,completed,59,71,65,100,997
998,female,group D,some college,standard,completed,68,78,77,100,998
999,female,group D,some college,free/reduced,none,77,86,86,100,999

In [68]:
np.random.randint(1,100, size=1000)

array([16, 67, 39, 53, 42, 66, 63, 66, 13, 95, 83, 52, 15, 86, 28, 42,  5,
       36,  3, 56, 65, 40, 97, 84, 99, 57, 69, 29, 11, 95, 58, 22,  1, 20,
        1, 17, 47, 96, 87,  6, 54, 63, 95, 31, 57, 87, 30, 81, 65, 69, 32,
       81, 28, 16, 38, 67, 43, 78, 63, 19, 27, 74, 97, 57,  8, 36, 40, 88,
        6, 97, 39, 26, 69, 56, 99, 95, 24, 17, 82, 88, 22, 39, 85, 58, 93,
       91,  3, 11, 76, 11, 54, 23, 18, 49, 33, 97, 31, 35, 86, 19, 20, 11,
       88, 66, 86, 81, 42, 16, 73, 15, 26, 15, 27, 66,  4, 84, 85,  4, 94,
       73, 30, 52, 23, 99, 50, 44, 87, 35, 11, 66, 17, 35, 20, 58, 71, 98,
       36, 38, 61, 51, 36, 35, 63, 89, 70, 86, 76, 16, 61, 25, 90, 12, 68,
       87, 99, 17, 65, 75,  8, 78, 95, 70, 44, 39, 15, 67, 20, 82, 34,  5,
       50, 14, 23, 50, 26, 94, 95, 61, 29, 54, 98, 45, 14, 44, 28, 23, 55,
       94, 37, 22, 28, 21, 10, 47, 39, 93, 24, 34, 42, 44, 73, 65, 41, 11,
       57, 33, 50, 74, 44, 39, 85, 74, 50, 44, 73, 81, 21, 83, 12, 96,  2,
       11, 52, 48, 50, 37, 28, 19, 24, 74, 41, 84, 78, 22, 13, 69, 11, 99,
       21, 17, 28,  6, 79, 71, 78,  5, 52, 41, 39,  9, 27, 83, 37, 52, 81,
       25, 42, 12,  3, 60, 14, 21, 90, 36, 33, 93, 78, 47, 55, 96, 76, 66,
       60, 44, 48,  2, 28, 76, 93, 36, 12, 14, 40, 36, 80, 86, 13, 58, 47,
       11, 53, 87, 55, 68, 95, 84, 79, 66, 36, 57, 77, 90, 43, 43, 18, 55,
       68, 71, 94,  4, 76, 13, 69, 72, 54, 51, 21, 88, 18, 46,  9, 57, 68,
        1, 47, 92, 38, 92, 43, 90,  6, 71, 67,  3, 44, 21, 27, 10, 35, 59,
       65, 39, 47, 74, 66, 94, 80, 29, 46, 96, 26, 44, 65, 56, 98, 48, 92,
       45, 85, 73, 29, 50, 24, 37, 88, 34, 27, 36, 81, 78, 43, 28, 91, 46,
       28, 50, 72, 15, 55, 25, 60,  8, 78,  8, 71,  5, 96, 13, 61, 43, 18,
       17, 29, 87, 38, 82, 18, 75, 13, 14, 29, 71,  4, 76, 21, 46, 32, 18,
        6,  7, 75, 70, 25, 46, 67, 23, 49, 70, 41, 94, 32, 28, 61, 89, 17,
       59, 84,  7, 70, 84, 93,  2, 15, 24, 12, 54,  3, 14, 83, 91, 81, 40,
       72, 83, 86, 20, 72, 61, 77, 29, 52,  8, 19, 51, 64, 59, 92, 59, 20,
       37, 91, 18,  1,  6, 12, 22, 92, 12, 60, 79, 64, 99, 66, 84, 46, 75,
       16, 10, 32, 82, 24, 93, 51, 90, 85,  3, 69, 73, 64, 66, 31, 18, 26,
       28, 78, 53, 93,  8, 80, 15, 88, 97, 45, 84, 33, 80, 74, 61, 18, 71,
       30, 75, 20,  5, 55, 40, 76, 97, 68, 46, 76,  9, 84, 74, 81, 36, 80,
       53, 16, 27, 96, 24, 27, 71, 86,  4, 39,  9, 41, 71, 90, 65, 17,  4,
       35, 16, 21, 17, 37, 16, 95, 71, 76, 67, 62, 90, 37, 68, 55, 74, 57,
       94,  4, 16, 29, 45, 31,  2, 62, 27, 67, 67, 62,  3, 25, 25, 28, 53,
       88, 49, 23, 58, 61, 55, 14, 60, 10, 58, 74, 57, 23, 91, 91,  6, 97,
       37, 99,  5, 60, 84, 90, 41,  9, 96, 20, 87, 92, 61, 85, 92, 65, 26,
        2, 79, 49,  2, 39, 20, 54, 92, 48, 13, 18, 92, 11, 42, 18, 71, 82,
       55, 24, 64, 56, 59, 13, 53, 63,  3, 56, 98, 97, 12, 72, 59,  6, 75,
       92, 59, 83, 97, 38, 46,  7, 38, 54, 31, 21, 45, 74, 26,  2, 31, 15,
       59, 31, 23, 71, 47, 37, 18, 61, 30,  2, 27, 22, 35, 51, 42, 29, 67,
       41, 22, 71, 13, 83,  9, 13, 36, 41, 89, 83, 44, 82, 37, 24, 13, 36,
        7, 49, 68, 39, 62, 19, 85, 50, 28, 88,  3, 10, 79, 22, 77, 16, 44,
       56, 68, 56, 62, 88, 92, 48,  8, 25, 31, 35, 17, 27,  9, 54, 72, 67,
       18, 56, 72,  8, 92, 61,  1, 75,  1, 19, 42, 98, 55, 85, 42,  3, 69,
       81, 81, 85, 38, 94, 84, 77, 82, 34, 20,  7, 98, 11,  4, 94, 94, 71,
       44, 70, 92, 21, 64, 75, 41, 79,  5,  2, 43,  9,  8, 25, 23, 89, 52,
       34, 65, 92, 91, 68, 69, 24, 19, 78, 22, 44, 71, 49, 42, 92,  2, 18,
       78, 30, 49, 14, 51, 68, 90, 46, 82, 72, 59, 46,  4, 93, 60, 79, 47,
       67, 62, 45, 96, 24,  2, 46,  5, 22, 30, 45, 47,  1, 91, 80, 72, 54,
       32, 49,  2, 70, 70, 71, 95, 76, 50, 12, 91, 55, 36, 33, 40, 44, 93,
       25, 17, 60, 67, 22, 82, 65, 43, 78, 80, 69, 19, 74, 78, 44, 83, 60,
       82, 14, 96, 91, 36, 85, 17, 35, 30, 50, 84, 59, 74, 21,  5, 38, 27,
       58, 81, 99, 45, 78, 26, 26, 47,  6, 63,  2, 14, 24, 56, 11, 52, 96,
       76, 17, 65, 80, 98, 93, 54, 70,  4, 48, 44,  1, 82, 74, 25, 12, 48,
       11, 81, 83, 89, 22, 30, 20, 72, 83, 23, 63, 92, 54, 18,  3, 48, 51,
       36, 12, 10,  3, 29, 33, 73, 70, 93, 26, 10,  8, 75, 48, 49, 82, 99,
       97, 72, 49,  2, 69, 60, 69, 91, 41, 93, 55,  2, 77, 80, 99, 80, 51,
       48, 53, 34, 99, 95, 74, 39, 82, 20, 14, 73, 60, 75, 69,  3, 16, 64,
       41, 75, 52, 27, 58, 71, 47, 26, 98, 55, 67, 43, 38, 53],
      dtype=int32)

In [69]:
int_language_score = np.random.randint(1,101, size=1000)
max(int_language_score)

np.int32(100)

In [70]:
df_csv["New Language Score"] = int_language_score
df_csv

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,New Column,language score,New Language Score
0,female,group B,bachelor's degree,standard,none,72,72,74,100,0,7
1,female,group C,some college,standard,completed,69,90,88,100,1,30
2,female,group B,master's degree,standard,none,90,95,93,100,2,36
3,male,group A,associate's degree,free/reduced,none,47,57,44,100,3,55
4,male,group C,some college,standard,none,76,78,75,100,4,43
...,...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,100,995,32
996,male,group C,high school,free/reduced,none,62,55,55,100,996,50
997,female,group C,high school,free/reduced,completed,59,71,65,100,997,43
998,female,group D,some college,standard,completed,68,78,77,100,998,28
999,female,group D,some college,free/reduced,none,77,86,86,100,999,41

In [71]:
# creating random float numbers
np.random.uniform(1, 100, size=1000)

array([70.54563001, 90.25139917, 34.08359501, 93.50307509, 13.78907218,
       84.62514463,  4.37832197, 75.68068242, 81.01840209, 32.98807536,
       61.13334237,  7.15091866, 72.08475131, 74.42180638, 92.58920754,
       14.71681561, 64.32239674, 85.55856018, 84.004279  , 19.65219743,
       39.44291945, 81.68103347, 54.19688491, 76.39732577, 62.87709308,
       72.28602157, 71.39253094, 75.29233218, 40.22800541, 64.85612754,
       27.71850075, 75.32389226, 85.78662091, 38.66588083, 30.72253999,
       77.93115189, 37.1290508 , 24.23391273, 45.20447875, 78.59347275,
       39.87874994,  8.2443578 , 29.19732465, 51.52841047,  2.00576052,
       76.84294852, 43.99913265, 32.97733287,  2.97847188, 95.7224074 ,
       90.71544375, 68.44126425, 18.90418983, 92.90609347, 72.57166642,
       54.56467602, 26.51983106, 61.0373191 , 77.54198088, 46.28160446,
       83.66936226, 16.58037506, 10.75089825, 90.89715914, 66.21514109,
       48.51579519, 78.57516613, 34.00138939, 86.48465158,  6.15787817,
       97.52082826, 59.26936147, 15.54602852, 85.16870585, 24.59222974,
       60.44189456, 29.57168019, 67.97014689, 13.82428013, 92.8362399 ,
       54.2551416 ,  7.33512566,  4.20840476, 19.39336765, 88.19980044,
       54.83329141, 23.10273677, 78.66714087, 12.77104486, 20.57443298,
       41.60010948, 28.46564908, 81.06129206, 56.01687868, 35.94838051,
       93.10753382,  5.90309974, 95.93351895, 18.29152087,  1.70086685,
       37.82916152, 19.48375611, 63.32307299, 82.07409422, 51.34019844,
       41.63260923, 76.81730187, 43.47159309, 28.58479212, 61.6123261 ,
       78.57477782, 65.14754437, 74.96632417,  8.73885484, 90.06239905,
       20.7062639 , 42.70378479, 14.26987315, 52.29067139, 20.68498793,
       32.16848294, 67.51566421, 16.83382985, 77.10858688, 21.89118535,
       61.98000875, 10.39267549, 45.42644792, 74.95679396, 79.54453918,
       14.48842601, 54.66323546, 60.08571282, 69.69224818, 67.10310772,
       90.9189201 , 55.21471992, 99.31339838, 45.72383449, 49.38022431,
       50.36341359, 53.36703982, 20.87205547, 81.45894273, 18.77730559,
        8.03520034, 46.80316827, 71.37103845, 47.49356496, 32.39836783,
       26.8372533 , 93.16343219, 65.0688112 , 35.94958244, 46.28784145,
       24.48828441, 57.48485754, 49.92730826,  1.31404325, 97.95371634,
       95.18775261, 83.27758925, 40.87167961, 72.18899285, 32.09707103,
       20.07150705, 79.57704707, 87.35905074, 82.77579301, 25.96311669,
       89.90617687, 53.08660159, 10.38424195, 11.11383211, 98.99770312,
       65.07769056, 58.56330898, 79.28320121, 74.41227893, 97.61634125,
       26.37221706,  3.31337189, 57.70484674, 92.04290441, 95.79377258,
       46.70147472, 52.90687088,  9.28970626, 75.1845662 , 31.18903374,
       80.49208979, 17.64239093, 13.83387853,  9.74184072, 27.47351609,
       94.72020691, 64.47023254, 87.76106715, 69.747533  ,  1.97363829,
       16.75179595, 29.46025101, 42.5351546 ,  1.73732822, 10.68979131,
       95.40099943, 34.13307117, 38.24778595, 27.57369079, 40.41079567,
        3.39069527, 84.42023228, 24.30394374, 18.70341901, 94.52395302,
       16.42534345, 96.80696315, 95.73795092, 71.34833843, 44.49567976,
       47.23919731, 98.60386707,  9.6410552 , 70.46336086, 72.42537993,
       40.2759792 , 48.20765337, 57.77350247, 93.95110662, 34.16794542,
       37.71616809, 28.06227003, 42.2303667 , 22.72565936, 28.83454244,
       25.89307539, 21.90362555, 28.7350004 , 63.21630618, 15.42634922,
       81.55181081, 44.20531484, 70.69850755, 44.6299324 , 78.90582626,
       68.80867558, 53.9668978 , 10.1038148 , 37.50653861, 32.20485951,
       24.93359544, 22.77542918, 63.05103517, 17.37629346, 39.66817887,
       68.26456905, 92.8591064 , 44.3980627 , 86.26389405, 61.36996281,
       23.89199848, 56.60874578, 75.22670821, 61.4092286 , 78.70832036,
       48.93135949, 98.58098698, 85.25294254, 81.85895795, 97.93703541,
        9.11345755, 67.14550829, 40.19265978, 44.59887582, 17.62591779,
       35.81067879, 39.36349093,  9.8528585 , 58.25604443, 62.72133519,
       25.350827  , 88.42407417, 62.74992186, 97.39196023, 47.28091144,
        3.16179637, 94.98065371, 85.23511818, 48.93310805, 10.07526977,
       31.45604926, 29.23752297, 38.90450581, 60.73284955, 69.76890635,
       91.06377695, 27.94765262, 44.06504109, 53.67289113, 61.36669419,
       58.29311666, 51.17163863, 75.73905898, 75.96467301, 46.65808863,
       36.4197764 , 11.77146709, 29.98023354, 23.76583774, 83.55196168,
       75.98987549, 31.62096658, 44.72923655, 22.27162171, 17.86593359,
       63.38585507, 23.29379415, 15.22575456, 66.42774258, 72.81502309,
       63.30297244, 47.72833797, 69.58384277, 82.17274665, 97.9146225 ,
       84.54498107, 22.6483281 , 52.67579506, 22.71926912, 31.6172448 ,
       72.86455409, 63.20339177, 61.96049377, 22.45432438, 84.74107821,
       12.63087777, 95.58948745,  1.02124226, 42.52831182, 64.6877301 ,
       82.7281242 , 11.60930541, 95.92284705, 33.13435524, 85.76053334,
       54.39019469, 56.34027705, 99.7647881 ,  7.66173683, 40.91791159,
       65.6633241 , 99.64373515, 71.36538519, 44.34903075, 65.4866687 ,
       25.29154861, 29.81678232, 74.27285104, 98.65053763, 62.30680602,
       28.75520335, 60.87655826, 88.06624315, 45.33892779, 17.50945492,
       74.78901244, 63.88083422, 59.53606043, 22.81228963, 73.9256264 ,
       69.6706665 , 25.98109835, 49.0365489 , 71.73217187, 41.05962304,
        4.84256673, 63.61319176,  6.99490514, 23.28856079, 15.44768444,
       19.67638524, 81.61545882, 54.19703472, 70.750526  , 76.2738609 ,
       64.11545781, 52.98408956, 50.21094745, 82.8770306 , 87.9982    ,
       50.88829988, 57.49609022,  9.833537  , 13.24140272, 49.78320283,
       68.62141622, 21.18937753, 43.21458487, 15.41973292, 98.16440987,
       36.78857856, 23.82925482, 69.67141632,  8.83435226, 78.3262911 ,
       17.11416194, 63.72472958, 19.46195645,  4.03591721, 41.5489091 ,
       84.1660256 , 21.95213908, 72.72760038, 50.62578731,  1.48363723,
       68.61960095, 41.59755111, 38.42585013,  5.31502624, 87.69853888,
       37.90812935, 32.41439143, 20.11674089,  5.2127876 , 26.23614334,
       82.94386181, 54.07958632, 37.75929538, 24.13212549, 75.52923854,
       65.53120674, 58.11715654, 99.13465378, 57.0653051 , 31.49605212,
       49.26493899, 90.18034276, 76.44230167, 96.9824232 , 21.7135212 ,
       47.31022628, 65.77875611, 10.83618782,  9.09219805, 66.60175998,
       14.34826911, 78.80149061, 18.91996671, 56.65476961, 51.52846414,
       32.89936433, 71.76308599, 90.30231348, 28.5289394 ,  6.77267253,
       19.98547282, 13.23334791, 56.718624  , 55.6030457 , 39.64215883,
       27.17411343, 14.26380471, 34.08481513,  7.90633594, 29.50347972,
       60.47441149, 25.30642113, 38.8211843 , 51.19690564, 16.39406943,
       56.49489714, 31.41193365, 48.02870197, 93.88461839, 82.18587223,
       74.43082408, 59.34976407, 23.27123181, 40.77844619, 30.07353725,
       31.61209012, 18.33860854, 92.45133985, 58.52332123, 43.28740782,
       41.91969371, 28.97971903, 51.87343855, 58.93190327, 89.96962355,
       76.4392571 , 66.06432802, 62.27682152, 82.61829501, 31.88463576,
       65.74371937, 44.29599576, 27.34792006, 80.12649725, 11.33498597,
       75.40300038, 69.11226679, 51.7775182 , 81.05852787, 38.25093574,
       43.87194512, 87.30512106, 34.44450439, 87.78214037, 64.42130359,
       75.51853085,  1.93679892, 97.41237921, 16.22935518, 62.73612384,
       98.21123056, 37.55529759, 13.06359269, 17.64385932, 90.4216876 ,
       81.08743922,  2.66219551, 40.60369045, 42.17584376,  5.09208126,
       71.97708165, 73.44736502, 94.06786901, 57.31351737, 36.41345951,
       85.02665556,  5.52025305, 79.70522316, 42.1590666 , 34.2093256 ,
       73.01691362,  5.43497136, 18.94040741, 61.32280509, 95.87729154,
       95.8881342 , 13.87542871, 48.67972621, 51.79682985, 77.68385518,
       94.80574885, 90.49298974, 48.91913949, 37.15578363, 94.23792374,
       38.48389418, 14.98437339, 77.5281592 , 37.86317118, 81.018895  ,
       65.25074797, 57.0464824 , 22.22680088, 73.83647173, 95.11035323,
        5.70801452, 36.4777407 , 30.85259665, 73.97257829, 18.51140705,
       98.94189446, 41.19749559, 21.24678362, 40.23071042, 95.00076342,
       63.15361094, 89.21054627, 50.90861726, 24.97197245, 39.37315321,
       51.05193631, 73.55922143,  9.9923575 , 10.30885703, 17.86797122,
       20.49968347, 62.52251741, 22.2656842 , 13.86461149, 74.29651164,
       80.1352469 , 84.4324364 , 32.5271668 , 19.09233495, 54.37312959,
       99.84273523, 33.40456912,  7.9970285 , 12.53028578, 46.38806532,
       50.07110818, 63.8323377 , 72.12810567, 17.25826219, 87.35208003,
       22.24436441, 54.38009527, 99.15567284, 35.4424342 , 24.03260555,
       32.18128142, 11.53514844, 90.76843657, 99.38943911, 61.06264109,
       15.1497178 ,  6.07188338,  4.71099353, 12.63862611, 77.814279  ,
       55.71717914,  8.35957298, 88.27633429, 37.88064257, 28.89118035,
       13.55478363,  2.79871628, 24.50180541, 19.80684889, 97.13774697,
       52.01781447, 58.00988783, 35.26252065, 91.51437776, 65.66326792,
       35.36582763, 16.87204891, 64.60057286, 81.34471209, 67.40145796,
       47.09069861, 54.85436686, 31.57210264, 70.24947484, 96.74944045,
       89.02200411, 60.64083232, 94.95013395, 18.75141687, 84.48523982,
       90.86838707,  4.92591493, 85.75753102, 65.4863929 , 66.55346345,
       11.69444305, 60.99382609, 14.92042622, 53.616895  , 76.20315034,
       38.61133319, 13.16071456, 88.88013824,  8.66473466, 52.40991022,
       15.94981116, 98.31893713,  3.6952047 , 31.28947992, 18.32507088,
       86.60295538, 20.9875445 , 18.09347604, 15.71021092, 15.04074549,
       18.88122759, 37.78926663, 45.25560307, 27.80380533, 31.67021758,
       70.66194701, 45.5131355 , 88.17285388,  1.27069202, 56.4899742 ,
       79.48873221, 61.30374174, 30.42920593, 95.67928347, 81.18247636,
       39.69281408, 78.35352376, 47.24980017, 63.63282312, 48.51390159,
       82.48397863, 60.4018032 , 17.79754873,  6.86296042,  7.29891887,
       89.87289821, 78.9073637 , 62.71745023, 54.70765479, 86.26784734,
        2.87074805, 63.67371316, 78.61493219, 83.62751266, 97.43726482,
       88.5239341 , 79.10354212, 67.22378624, 75.56122827, 61.23339165,
       26.64947703,  1.49886611, 24.0666757 , 19.8933688 , 89.8109504 ,
       87.57269456, 59.42147399, 47.7493526 , 96.69561569, 85.83029658,
       19.27748152, 53.00210656, 20.79257812, 33.05320468, 15.91508534,
        5.79957633, 40.49420602, 58.33308553, 54.24071946, 94.51238775,
       65.02220313, 37.06628723, 12.33656924, 45.65376106, 99.64797713,
       87.30979548,  4.44023197, 28.27615075, 35.22858503, 55.9601601 ,
       98.61580206, 93.86022015, 10.77401995, 34.14448965, 70.11610006,
       35.45275697,  4.39052147, 78.08489429, 14.1018018 , 19.97103569,
       67.86223521, 26.12968447, 40.90400409, 93.72168589, 20.64648118,
       13.13778998, 84.93151797, 18.73536353, 17.92556934, 96.79764898,
       83.90791081, 42.42037456,  4.58237449, 96.91622369, 91.73907673,
       28.55290735, 23.29134072, 46.98061871, 76.95357017, 85.15494331,
       82.46004281, 47.52671724, 49.06321358, 61.84993571,  1.3131755 ,
       58.31904803, 23.15481918, 22.30233045, 41.36927514, 87.3798023 ,
       23.96348974, 77.0318377 ,  6.71066163, 32.75177921, 95.37412372,
       93.62268527, 16.09814854, 98.55332701, 32.46310322, 48.01702459,
        7.54789107,  7.42129435, 84.98500186, 21.1765852 , 68.50065999,
       41.27307332, 31.12651537, 23.66951118, 49.1346945 , 79.34421997,
       73.83820841, 49.07513269, 18.55628327, 90.17569009, 50.34491665,
       59.40004526, 15.68237993, 68.40873392, 65.81301303, 23.54243994,
       53.77319317,  7.53912776,  9.84422213, 89.74533858,  8.48422752,
        2.61210531, 34.10469404, 31.09634624, 78.1367286 , 90.64177561,
       28.25247381, 50.49339685, 47.65757971, 92.82368346, 80.44851547,
        3.87379556, 79.23320797, 70.62968845, 45.81337365, 22.03148634,
       81.66982171, 26.60014756, 41.80280096, 95.41492083, 88.58693734,
       18.05991574, 47.55679792, 92.15124924, 60.55620923, 11.54791728,
       98.55299085, 85.80715581, 32.78959219, 25.41598151, 91.68755834,
        4.79845155,  8.91712132, 31.76839577, 79.76816215, 45.34855992,
       88.21846593,  9.01340764, 86.7881092 ,  9.28099005, 24.43595623,
        7.83284434, 93.79271673, 60.00879396,  7.71287845, 31.91757057,
       28.73118421, 19.6424438 , 93.0417317 , 52.37951731, 76.23904452,
       98.48108325, 92.21042229, 93.19390299, 37.08507101, 19.04384738,
       76.60064984, 95.74983232, 91.02069569, 94.54613055, 15.31402946,
       17.59146454, 37.00128577, 49.27034919, 64.24746554, 97.32019987,
       39.57749442, 90.66222856, 13.26702122, 61.14701741, 91.3033998 ,
       85.09465013, 13.75773402, 39.04940558, 57.99575727, 30.96137658,
       75.51404679, 15.29799812,  2.54287657, 33.93817206, 94.56330204,
       92.80018625, 46.03207664, 58.47551998, 98.22164809, 89.46585627,
       51.62303586, 48.42216224, 81.743917  , 73.35498307, 42.10380269,
       87.44955171, 67.43871372, 81.82254225,  7.66735759, 45.3651531 ,
       16.76070037, 17.49469226, 96.42367324, 99.78078755, 50.18479955,
       33.65291368, 86.40695966, 79.73024953, 18.31585462, 40.14210558,
       64.6337578 , 54.15413015, 38.40523972, 36.04502747, 35.2687106 ,
       92.84657936, 61.41612123, 40.83932972, 88.24536289, 86.31547172,
       17.32583602, 21.7306975 , 43.01988538, 57.08143776, 99.31540338,
       38.70366738, 95.9479442 , 61.7030708 , 80.67358444, 66.04326274,
       66.23756154, 98.1864309 , 11.94810199, 71.78095791, 59.69594289,
       19.562349  , 15.0351257 , 37.20114427, 28.73110822, 81.81720411,
       76.31410162, 25.39313623, 41.06481508, 28.50029997, 72.99087573,
       10.58881165, 94.56638721, 35.99039562,  2.09315335, 98.70838961,
       43.5559035 , 87.81012347, 23.52086228, 51.54910911, 79.34111571,
       26.63778895, 13.08326681, 25.12368873, 58.23330241,  6.56132987,
       79.73104195, 79.33187974, 78.88246265, 29.69310772, 80.99863494,
       81.35568033, 37.23020603, 89.33694941, 87.03111842, 52.49030027,
        2.08501493, 71.1393577 , 86.7162957 , 55.79200891, 90.52553914,
       22.33027126, 39.06118484, 50.16854681, 10.17779863, 59.6848779 ,
       84.08103205,  7.11805978, 76.31431993, 43.52489629, 98.54171347,
       42.64111865, 51.60822438, 62.55450046, 32.11054301, 94.88762683])

In [72]:
# Assign a new column using assign() and insert() methods
# You use the assign method when you want to add multiple columns at once
# You use the insert method when you want to add a column at a specific position
# What of we do not declare the size? 
# It will throw an error because the length of the new column must match the length of the DataFrame

# df_csv = df_csv.assign(
#     science_score = np.random.randint(1,101, size=1000),
#     social_studies_score = np.random.randint(1,101, size=1000)
# )

# df_csv.head()

 # When to use assign

. Add multiple columns in a single line of code


. When you need to overwrite the values of an existing columns(best practice)


It returns a new object(a copy) with all the original columns in addition to the new ones

In [73]:
score1 = np.random.randint(1,100, size =1000)
score2 = np.random.randint(1,100, size =1000)

In [74]:
series1 = pd.Series(score1, index = np.arange(0,1000))
series2 = pd.Series(score2, index = np.arange(0,1000))

In [75]:
# using assign method to add multiple columns
df_csv.assign(score1 = series1, score2 = series2)
df_csv.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,New Column,language score,New Language Score
0,female,group B,bachelor's degree,standard,none,72,72,74,100,0,7
1,female,group C,some college,standard,completed,69,90,88,100,1,30
2,female,group B,master's degree,standard,none,90,95,93,100,2,36
3,male,group A,associate's degree,free/reduced,none,47,57,44,100,3,55
4,male,group C,some college,standard,none,76,78,75,100,4,43